Tekla Open API Reference for Tekla Structures 2025
BoltGroup.GetOtherPartsToBolt Method
 Returns an array list containing all the other parts that are bolted.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ArrayList GetOtherPartsToBolt()
Public Function GetOtherPartsToBolt As ArrayList
Return Value
Type: ArrayList
An array list of parts containing all the other parts that are bolted.
See Also
Reference
BoltGroup Class
Tekla.Structures.Model Namespace